[
  {
    "id": "c_00",
    "text": "JALADI ASHISH \n \nLinkedin: https://www.linkedin.com/in/ashish-jaladi-046a3b24a/ \n +91 9493110947 \n ashujaladi5995@gmail.com \n \n \nPROFESSIONAL SUMMARY \n \nResults-driven Computer Science and Engineering undergraduate specializing in Artificial Intelligence and Machine \nLearning (CGPA 9.30) with strong expertise in deep learning, natural language processing (NLP), computer vision, \nand backend development. Proficient in Python, Java, C++, and modern web frameworks, with experience in \ndeveloping and deploying AI-powered applications. Skilled in LLM integration, Retrieval- Augmented Generation \n(RAG), LangChain, LangGraph, and vector database optimization. Adept at full-stack development, API integration, and \ndatabase management. Passionate about Generative AI, transformer models, and scalable backend architectures, with \nproven success in hackathons, research projects, and production-ready solutions. \n \nEDUCATION \n \n \n(2022 – Present) \nVellore Institute of \nTechnology, Chennai \n2020 - 2022 \nVelammal Vidyalaya, \nChennai \n2018 - 2020 \nArya Central School, \nTrivandrum \nB.Tech \n– \nComputer \nScience \n& \nEngineering (Specialization: AI & ML) \nCGPA: 9.30 \n \nHigher Secondary Board Examination \nFinal grade: 91.3% \n \n \nSecondary Board Examination \nFinal grade: 95.6% \nPROFESSIONAL EXPERIENCE \n \nAI/ML & Backend Development Intern – Primesoft Enterprise IT Services Pvt. Ltd., Chennai \nMay 2025 – Jul 2025 \nContributed to “AI Interview”, an AI-driven chatbot application to automate technical interview processes for \nenterprises. \nDeveloped backend APIs using FastAPI, ensuring high-performance data handling. \nManaged PostgreSQL (relational) and Neo4j (graph) databases with optimized query performance. \nIntegrated LangChain and LangGraph for dynamic question flow and AI-driven evaluation. \nImplemented automated scoring algorithms and candidate evaluation logic, improving interview efficiency by 25%. \nCollaborated with cross-functional teams for scalable deployment and UI/UX optimization. \n \n \n \nPROJECTS \n \nSmart Document Chat – AI-powered PDF Q&A System (Python, React, LangChain, LangGraph, FAISS, \nPyMuPDF, PDF.js) \n \n \nBuilt an interactive chatbot assistant capable of answering questions with textbook-style responses and sentence- \nlevel evidence highlighting directly in PDFs. \n \nDesigned a two-pass RAG pipeline using LangChain + LangGraph with FAISS for retrieval and reasoning + teaching \nanswer generation. \n \nImplemented spaCy + syntok-based segmentation with structural repair and coverage-aware cleaning for precise \nevidence mapping. \n \nIntegrated a React frontend with PDF.js for seamless navigation, page-level scrolling, and robust annotation \ndisplay.\nLandslide Detection Using Image Segmentation (Python, UNet, Transformer, CRFF) \n \nDeveloped a UNet-based segmentation model with transformer and cross-feature fusion for satellite imagery \nanalysis. \n \nAchieved F1-score 93.8% and IoU 83.5% on Landslide4Sense dataset, surpassing benchmarks. \n \nUsed coordinate attention blocks and edge enhancement for improved precision. \n \nProcessed 14-band HDF5-formatted images for training and evaluation. \n \nReal-Time Stock Prediction System (AWS, SageMaker, S3, Amplify, Random Forest Regressor) \n \n• Built a cloud-based system for real-time stock price prediction and Bollinger Band-based volatility analysis. \n• Trained and deployed a Random Forest Regressor on AWS SageMaker using historical market data for robust \nforecasting. \n• Utilized Lambda, Kinesis, Step Functions, and DynamoDB for scalable automation and real-time data processing."
  },
  {
    "id": "c_01",
    "text": "Processed 14-band HDF5-formatted images for training and evaluation. \n \nReal-Time Stock Prediction System (AWS, SageMaker, S3, Amplify, Random Forest Regressor) \n \n• Built a cloud-based system for real-time stock price prediction and Bollinger Band-based volatility analysis. \n• Trained and deployed a Random Forest Regressor on AWS SageMaker using historical market data for robust \nforecasting. \n• Utilized Lambda, Kinesis, Step Functions, and DynamoDB for scalable automation and real-time data processing. \n \nSimon Says Game (HTML, CSS, JavaScript) [demo] \n• \nBuilt an interactive Simon Says game with engaging and dynamic gameplay. \n• \nImplemented intuitive user interfaces for smooth interaction and visual feedback. \n• \nAdded a navigation system to a separate page for game rules, with responsive design and flashing buttons to show \nuser presses. \n \n \n \nCERTIFICATIONS \n \n Stanford University – Supervised Machine Learning: Regression and Classification \n LangChain Academy – Introduction to LangGraph for Stateful LLM Applications \n \n Skill India – Summer Internship in Android App Development \n Neo4j Certified – Fundamentals, Cypher Queries, Graph Data Modeling, Python Integration \n Bootcamp in Machine Learning – Core ML algorithms, model evaluation, deployment \n \nTECHNICAL SKILLS \n \n Programming Languages: Python, Java, C++, C \n LLM & AI Tools: LangChain, LangGraph, CrewAI, ChatOllama, FAISS, RAG Pipelines, Prompt Engineering, Vector \nDatabases \n Backend Development: .NET, FastAPI, Node.js \n Frontend Development: JavaScript, HTML, CSS, React, Bootstrap, jQuery, JavaScript \n Databases:SQL, MySQL, PostgreSQL, Neo4j \n Tools and Frameworks: Android Studio, Unity, Latex, Power BI \n  Cloud Technologies: AWS \nOther Skills: Object-Oriented Programming (OOP), Machine Learning, Pandas, OpenCV , Git \n \n \nACHIEVEMENTS & ACTIVITIES \n \n 2nd Place – National Hackathon “Dataset 2024” (Generative AI theme) \n 1st Place – “App Marvel” App Development Competition \n Member – Data Science Club (Projects Department) at VIT Chennai"
  }
]